In [2]:
import pandas as pd

In [3]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [4]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [5]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [7]:
pd.merge(employees, departments, on="DeptID")

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [10]:
pd.merge(employees, departments, on="DeptID", how="left")

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [11]:
pd.merge(employees, departments, on="DeptID", how="right")

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [12]:
pd.merge(employees, departments, on="DeptID", how="outer")

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [23]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "Score": [234,345]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"], "Age": [12,34]})

pd.concat([df1, df2])

      Name  Score   Age
0    Alice  234.0   NaN
1      Bob  345.0   NaN
0  Charlie    NaN  12.0
1    David    NaN  34.0

In [24]:
df1

    Name  Score
0  Alice    234
1    Bob    345

In [25]:
df2

      Name  Age
0  Charlie   12
1    David   34

In [26]:
pd.concat([df1,df2], axis=1)

    Name  Score     Name  Age
0  Alice    234  Charlie   12
1    Bob    345    David   34